MikroElektronika/core_packages/PIC/XC8/def/PIC16HV785/mcu.h
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
extern volatile unsigned char           OSCTUNE             __at(0x090);
#ifndef _LIB_BUILD
asm("OSCTUNE equ 090h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TUN                    :5;
    };
    struct {
        unsigned TUN0                   :1;
        unsigned TUN1                   :1;
        unsigned TUN2                   :1;
        unsigned TUN3                   :1;
        unsigned TUN4                   :1;
    };
} OSCTUNEbits_t;
extern volatile OSCTUNEbits_t OSCTUNEbits __at(0x090);
// bitfield macros
#define _OSCTUNE_TUN_POSN                                   0x0
#define _OSCTUNE_TUN_POSITION                               0x0
#define _OSCTUNE_TUN_SIZE                                   0x5
#define _OSCTUNE_TUN_LENGTH                                 0x5
#define _OSCTUNE_TUN_MASK                                   0x1F
#define _OSCTUNE_TUN0_POSN                                  0x0
#define _OSCTUNE_TUN0_POSITION                              0x0
#define _OSCTUNE_TUN0_SIZE                                  0x1
#define _OSCTUNE_TUN0_LENGTH                                0x1
#define _OSCTUNE_TUN0_MASK                                  0x1
#define _OSCTUNE_TUN1_POSN                                  0x1
#define _OSCTUNE_TUN1_POSITION                              0x1
#define _OSCTUNE_TUN1_SIZE                                  0x1
#define _OSCTUNE_TUN1_LENGTH                                0x1
#define _OSCTUNE_TUN1_MASK                                  0x2
#define _OSCTUNE_TUN2_POSN                                  0x2
#define _OSCTUNE_TUN2_POSITION                              0x2
#define _OSCTUNE_TUN2_SIZE                                  0x1
#define _OSCTUNE_TUN2_LENGTH                                0x1
#define _OSCTUNE_TUN2_MASK                                  0x4
#define _OSCTUNE_TUN3_POSN                                  0x3
#define _OSCTUNE_TUN3_POSITION                              0x3
#define _OSCTUNE_TUN3_SIZE                                  0x1
#define _OSCTUNE_TUN3_LENGTH                                0x1
#define _OSCTUNE_TUN3_MASK                                  0x8
#define _OSCTUNE_TUN4_POSN                                  0x4
#define _OSCTUNE_TUN4_POSITION                              0x4
#define _OSCTUNE_TUN4_SIZE                                  0x1
#define _OSCTUNE_TUN4_LENGTH                                0x1
#define _OSCTUNE_TUN4_MASK                                  0x10

// Register: ANSEL0
#define ANSEL0 ANSEL0
extern volatile unsigned char           ANSEL0              __at(0x091);
#ifndef _LIB_BUILD
asm("ANSEL0 equ 091h");
#endif
// aliases
extern volatile unsigned char           ANSEL               __at(0x091);
#ifndef _LIB_BUILD
asm("ANSEL equ 091h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANS0                   :1;
        unsigned ANS1                   :1;
        unsigned ANS2                   :1;
        unsigned ANS3                   :1;
        unsigned ANS4                   :1;
        unsigned ANS5                   :1;
        unsigned ANS6                   :1;
        unsigned ANS7                   :1;
    };
} ANSEL0bits_t;
extern volatile ANSEL0bits_t ANSEL0bits __at(0x091);
// bitfield macros
#define _ANSEL0_ANS0_POSN                                   0x0
#define _ANSEL0_ANS0_POSITION                               0x0
#define _ANSEL0_ANS0_SIZE                                   0x1
#define _ANSEL0_ANS0_LENGTH                                 0x1
#define _ANSEL0_ANS0_MASK                                   0x1
#define _ANSEL0_ANS1_POSN                                   0x1
#define _ANSEL0_ANS1_POSITION                               0x1
#define _ANSEL0_ANS1_SIZE                                   0x1
#define _ANSEL0_ANS1_LENGTH                                 0x1
#define _ANSEL0_ANS1_MASK                                   0x2
#define _ANSEL0_ANS2_POSN                                   0x2
#define _ANSEL0_ANS2_POSITION                               0x2
#define _ANSEL0_ANS2_SIZE                                   0x1
#define _ANSEL0_ANS2_LENGTH                                 0x1
#define _ANSEL0_ANS2_MASK                                   0x4
#define _ANSEL0_ANS3_POSN                                   0x3
#define _ANSEL0_ANS3_POSITION                               0x3
#define _ANSEL0_ANS3_SIZE                                   0x1
#define _ANSEL0_ANS3_LENGTH                                 0x1
#define _ANSEL0_ANS3_MASK                                   0x8
#define _ANSEL0_ANS4_POSN                                   0x4
#define _ANSEL0_ANS4_POSITION                               0x4
#define _ANSEL0_ANS4_SIZE                                   0x1
#define _ANSEL0_ANS4_LENGTH                                 0x1
#define _ANSEL0_ANS4_MASK                                   0x10
#define _ANSEL0_ANS5_POSN                                   0x5
#define _ANSEL0_ANS5_POSITION                               0x5
#define _ANSEL0_ANS5_SIZE                                   0x1
#define _ANSEL0_ANS5_LENGTH                                 0x1
#define _ANSEL0_ANS5_MASK                                   0x20
#define _ANSEL0_ANS6_POSN                                   0x6
#define _ANSEL0_ANS6_POSITION                               0x6
#define _ANSEL0_ANS6_SIZE                                   0x1
#define _ANSEL0_ANS6_LENGTH                                 0x1
#define _ANSEL0_ANS6_MASK                                   0x40
#define _ANSEL0_ANS7_POSN                                   0x7
#define _ANSEL0_ANS7_POSITION                               0x7
#define _ANSEL0_ANS7_SIZE                                   0x1
#define _ANSEL0_ANS7_LENGTH                                 0x1
#define _ANSEL0_ANS7_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned ANS0                   :1;
        unsigned ANS1                   :1;
        unsigned ANS2                   :1;
        unsigned ANS3                   :1;
        unsigned ANS4                   :1;
        unsigned ANS5                   :1;
        unsigned ANS6                   :1;
        unsigned ANS7                   :1;
    };
} ANSELbits_t;
extern volatile ANSELbits_t ANSELbits __at(0x091);
// bitfield macros
#define _ANSEL_ANS0_POSN                                    0x0
#define _ANSEL_ANS0_POSITION                                0x0
#define _ANSEL_ANS0_SIZE                                    0x1
#define _ANSEL_ANS0_LENGTH                                  0x1
#define _ANSEL_ANS0_MASK                                    0x1
#define _ANSEL_ANS1_POSN                                    0x1
#define _ANSEL_ANS1_POSITION                                0x1
#define _ANSEL_ANS1_SIZE                                    0x1
#define _ANSEL_ANS1_LENGTH                                  0x1
#define _ANSEL_ANS1_MASK                                    0x2
#define _ANSEL_ANS2_POSN                                    0x2
#define _ANSEL_ANS2_POSITION                                0x2
#define _ANSEL_ANS2_SIZE                                    0x1
#define _ANSEL_ANS2_LENGTH                                  0x1
#define _ANSEL_ANS2_MASK                                    0x4
#define _ANSEL_ANS3_POSN                                    0x3
#define _ANSEL_ANS3_POSITION                                0x3
#define _ANSEL_ANS3_SIZE                                    0x1
#define _ANSEL_ANS3_LENGTH                                  0x1
#define _ANSEL_ANS3_MASK                                    0x8
#define _ANSEL_ANS4_POSN                                    0x4
#define _ANSEL_ANS4_POSITION                                0x4
#define _ANSEL_ANS4_SIZE                                    0x1
#define _ANSEL_ANS4_LENGTH                                  0x1
#define _ANSEL_ANS4_MASK                                    0x10
#define _ANSEL_ANS5_POSN                                    0x5
#define _ANSEL_ANS5_POSITION                                0x5
#define _ANSEL_ANS5_SIZE                                    0x1
#define _ANSEL_ANS5_LENGTH                                  0x1
#define _ANSEL_ANS5_MASK                                    0x20
#define _ANSEL_ANS6_POSN                                    0x6
#define _ANSEL_ANS6_POSITION                                0x6
#define _ANSEL_ANS6_SIZE                                    0x1
#define _ANSEL_ANS6_LENGTH                                  0x1
#define _ANSEL_ANS6_MASK                                    0x40
#define _ANSEL_ANS7_POSN                                    0x7
#define _ANSEL_ANS7_POSITION                                0x7
#define _ANSEL_ANS7_SIZE                                    0x1
#define _ANSEL_ANS7_LENGTH                                  0x1
#define _ANSEL_ANS7_MASK                                    0x80

// Register: PR2
#define PR2 PR2
extern volatile unsigned char           PR2                 __at(0x092);
#ifndef _LIB_BUILD
asm("PR2 equ 092h");
#endif

// Register: ANSEL1
#define ANSEL1 ANSEL1
extern volatile unsigned char           ANSEL1              __at(0x093);
#ifndef _LIB_BUILD
asm("ANSEL1 equ 093h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANS8                   :1;
        unsigned ANS9                   :1;
        unsigned ANS10                  :1;
        unsigned ANS11                  :1;
    };
} ANSEL1bits_t;
extern volatile ANSEL1bits_t ANSEL1bits __at(0x093);
// bitfield macros
#define _ANSEL1_ANS8_POSN                                   0x0
#define _ANSEL1_ANS8_POSITION                               0x0
#define _ANSEL1_ANS8_SIZE                                   0x1
#define _ANSEL1_ANS8_LENGTH                                 0x1
#define _ANSEL1_ANS8_MASK                                   0x1
#define _ANSEL1_ANS9_POSN                                   0x1
#define _ANSEL1_ANS9_POSITION                               0x1
#define _ANSEL1_ANS9_SIZE                                   0x1
#define _ANSEL1_ANS9_LENGTH                                 0x1
#define _ANSEL1_ANS9_MASK                                   0x2
#define _ANSEL1_ANS10_POSN                                  0x2
#define _ANSEL1_ANS10_POSITION                              0x2
#define _ANSEL1_ANS10_SIZE                                  0x1
#define _ANSEL1_ANS10_LENGTH                                0x1
#define _ANSEL1_ANS10_MASK                                  0x4
#define _ANSEL1_ANS11_POSN                                  0x3
#define _ANSEL1_ANS11_POSITION                              0x3
#define _ANSEL1_ANS11_SIZE                                  0x1
#define _ANSEL1_ANS11_LENGTH                                0x1
#define _ANSEL1_ANS11_MASK                                  0x8

