MikroElektronika/core_packages/PIC/XC8/def/PIC16HV785/mcu.h
extern volatile VRCONbits_t VRCONbits __at(0x099);
// bitfield macros
#define _VRCON_VR0_POSN                                     0x0
#define _VRCON_VR0_POSITION                                 0x0
#define _VRCON_VR0_SIZE                                     0x1
#define _VRCON_VR0_LENGTH                                   0x1
#define _VRCON_VR0_MASK                                     0x1
#define _VRCON_VR1_POSN                                     0x1
#define _VRCON_VR1_POSITION                                 0x1
#define _VRCON_VR1_SIZE                                     0x1
#define _VRCON_VR1_LENGTH                                   0x1
#define _VRCON_VR1_MASK                                     0x2
#define _VRCON_VR2_POSN                                     0x2
#define _VRCON_VR2_POSITION                                 0x2
#define _VRCON_VR2_SIZE                                     0x1
#define _VRCON_VR2_LENGTH                                   0x1
#define _VRCON_VR2_MASK                                     0x4
#define _VRCON_VR3_POSN                                     0x3
#define _VRCON_VR3_POSITION                                 0x3
#define _VRCON_VR3_SIZE                                     0x1
#define _VRCON_VR3_LENGTH                                   0x1
#define _VRCON_VR3_MASK                                     0x8
#define _VRCON_VRR_POSN                                     0x5
#define _VRCON_VRR_POSITION                                 0x5
#define _VRCON_VRR_SIZE                                     0x1
#define _VRCON_VRR_LENGTH                                   0x1
#define _VRCON_VRR_MASK                                     0x20
#define _VRCON_C2VREN_POSN                                  0x6
#define _VRCON_C2VREN_POSITION                              0x6
#define _VRCON_C2VREN_SIZE                                  0x1
#define _VRCON_C2VREN_LENGTH                                0x1
#define _VRCON_C2VREN_MASK                                  0x40
#define _VRCON_C1VREN_POSN                                  0x7
#define _VRCON_C1VREN_POSITION                              0x7
#define _VRCON_C1VREN_SIZE                                  0x1
#define _VRCON_C1VREN_LENGTH                                0x1
#define _VRCON_C1VREN_MASK                                  0x80

// Register: EEDATA
#define EEDATA EEDATA
extern volatile unsigned char           EEDATA              __at(0x09A);
#ifndef _LIB_BUILD
asm("EEDATA equ 09Ah");
#endif
// aliases
extern volatile unsigned char           EEDAT               __at(0x09A);
#ifndef _LIB_BUILD
asm("EEDAT equ 09Ah");
#endif

// Register: EEADR
#define EEADR EEADR
extern volatile unsigned char           EEADR               __at(0x09B);
#ifndef _LIB_BUILD
asm("EEADR equ 09Bh");
#endif

// Register: EECON1
#define EECON1 EECON1
extern volatile unsigned char           EECON1              __at(0x09C);
#ifndef _LIB_BUILD
asm("EECON1 equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD                     :1;
        unsigned WR                     :1;
        unsigned WREN                   :1;
        unsigned WRERR                  :1;
    };
} EECON1bits_t;
extern volatile EECON1bits_t EECON1bits __at(0x09C);
// bitfield macros
#define _EECON1_RD_POSN                                     0x0
#define _EECON1_RD_POSITION                                 0x0
#define _EECON1_RD_SIZE                                     0x1
#define _EECON1_RD_LENGTH                                   0x1
#define _EECON1_RD_MASK                                     0x1
#define _EECON1_WR_POSN                                     0x1
#define _EECON1_WR_POSITION                                 0x1
#define _EECON1_WR_SIZE                                     0x1
#define _EECON1_WR_LENGTH                                   0x1
#define _EECON1_WR_MASK                                     0x2
#define _EECON1_WREN_POSN                                   0x2
#define _EECON1_WREN_POSITION                               0x2
#define _EECON1_WREN_SIZE                                   0x1
#define _EECON1_WREN_LENGTH                                 0x1
#define _EECON1_WREN_MASK                                   0x4
#define _EECON1_WRERR_POSN                                  0x3
#define _EECON1_WRERR_POSITION                              0x3
#define _EECON1_WRERR_SIZE                                  0x1
#define _EECON1_WRERR_LENGTH                                0x1
#define _EECON1_WRERR_MASK                                  0x8

// Register: EECON2
#define EECON2 EECON2
extern volatile unsigned char           EECON2              __at(0x09D);
#ifndef _LIB_BUILD
asm("EECON2 equ 09Dh");
#endif

// Register: ADRESL
#define ADRESL ADRESL
extern volatile unsigned char           ADRESL              __at(0x09E);
#ifndef _LIB_BUILD
asm("ADRESL equ 09Eh");
#endif

// Register: ADCON1
#define ADCON1 ADCON1
extern volatile unsigned char           ADCON1              __at(0x09F);
#ifndef _LIB_BUILD
asm("ADCON1 equ 09Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned ADCS                   :3;
    };
    struct {
        unsigned                        :4;
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
    };
} ADCON1bits_t;
extern volatile ADCON1bits_t ADCON1bits __at(0x09F);
// bitfield macros
#define _ADCON1_ADCS_POSN                                   0x4
#define _ADCON1_ADCS_POSITION                               0x4
#define _ADCON1_ADCS_SIZE                                   0x3
#define _ADCON1_ADCS_LENGTH                                 0x3
#define _ADCON1_ADCS_MASK                                   0x70
#define _ADCON1_ADCS0_POSN                                  0x4
#define _ADCON1_ADCS0_POSITION                              0x4
#define _ADCON1_ADCS0_SIZE                                  0x1
#define _ADCON1_ADCS0_LENGTH                                0x1
#define _ADCON1_ADCS0_MASK                                  0x10
#define _ADCON1_ADCS1_POSN                                  0x5
#define _ADCON1_ADCS1_POSITION                              0x5
#define _ADCON1_ADCS1_SIZE                                  0x1
#define _ADCON1_ADCS1_LENGTH                                0x1
#define _ADCON1_ADCS1_MASK                                  0x20
#define _ADCON1_ADCS2_POSN                                  0x6
#define _ADCON1_ADCS2_POSITION                              0x6
#define _ADCON1_ADCS2_SIZE                                  0x1
#define _ADCON1_ADCS2_LENGTH                                0x1
#define _ADCON1_ADCS2_MASK                                  0x40

// Register: PWMCON1
#define PWMCON1 PWMCON1
extern volatile unsigned char           PWMCON1             __at(0x110);
#ifndef _LIB_BUILD
asm("PWMCON1 equ 0110h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMDLY                  :5;
        unsigned COMOD                  :2;
        unsigned OVRLP                  :1;
    };
    struct {
        unsigned CMDLY0                 :1;
        unsigned CMDLY1                 :1;
        unsigned CMDLY2                 :1;
        unsigned CMDLY3                 :1;
        unsigned CMDLY4                 :1;
        unsigned COMOD0                 :1;
        unsigned COMOD1                 :1;
    };
} PWMCON1bits_t;
extern volatile PWMCON1bits_t PWMCON1bits __at(0x110);
// bitfield macros
#define _PWMCON1_CMDLY_POSN                                 0x0
#define _PWMCON1_CMDLY_POSITION                             0x0
#define _PWMCON1_CMDLY_SIZE                                 0x5
#define _PWMCON1_CMDLY_LENGTH                               0x5
#define _PWMCON1_CMDLY_MASK                                 0x1F
#define _PWMCON1_COMOD_POSN                                 0x5
#define _PWMCON1_COMOD_POSITION                             0x5
#define _PWMCON1_COMOD_SIZE                                 0x2
#define _PWMCON1_COMOD_LENGTH                               0x2
#define _PWMCON1_COMOD_MASK                                 0x60
#define _PWMCON1_OVRLP_POSN                                 0x7
#define _PWMCON1_OVRLP_POSITION                             0x7
#define _PWMCON1_OVRLP_SIZE                                 0x1
#define _PWMCON1_OVRLP_LENGTH                               0x1
#define _PWMCON1_OVRLP_MASK                                 0x80
#define _PWMCON1_CMDLY0_POSN                                0x0
#define _PWMCON1_CMDLY0_POSITION                            0x0
#define _PWMCON1_CMDLY0_SIZE                                0x1
#define _PWMCON1_CMDLY0_LENGTH                              0x1
#define _PWMCON1_CMDLY0_MASK                                0x1
#define _PWMCON1_CMDLY1_POSN                                0x1
#define _PWMCON1_CMDLY1_POSITION                            0x1
#define _PWMCON1_CMDLY1_SIZE                                0x1
#define _PWMCON1_CMDLY1_LENGTH                              0x1
#define _PWMCON1_CMDLY1_MASK                                0x2
#define _PWMCON1_CMDLY2_POSN                                0x2
#define _PWMCON1_CMDLY2_POSITION                            0x2
#define _PWMCON1_CMDLY2_SIZE                                0x1
#define _PWMCON1_CMDLY2_LENGTH                              0x1
#define _PWMCON1_CMDLY2_MASK                                0x4
#define _PWMCON1_CMDLY3_POSN                                0x3
#define _PWMCON1_CMDLY3_POSITION                            0x3
#define _PWMCON1_CMDLY3_SIZE                                0x1
#define _PWMCON1_CMDLY3_LENGTH                              0x1
#define _PWMCON1_CMDLY3_MASK                                0x8
#define _PWMCON1_CMDLY4_POSN                                0x4
#define _PWMCON1_CMDLY4_POSITION                            0x4
#define _PWMCON1_CMDLY4_SIZE                                0x1
#define _PWMCON1_CMDLY4_LENGTH                              0x1
#define _PWMCON1_CMDLY4_MASK                                0x10
#define _PWMCON1_COMOD0_POSN                                0x5
#define _PWMCON1_COMOD0_POSITION                            0x5
#define _PWMCON1_COMOD0_SIZE                                0x1
#define _PWMCON1_COMOD0_LENGTH                              0x1
#define _PWMCON1_COMOD0_MASK                                0x20
#define _PWMCON1_COMOD1_POSN                                0x6
#define _PWMCON1_COMOD1_POSITION                            0x6
#define _PWMCON1_COMOD1_SIZE                                0x1
#define _PWMCON1_COMOD1_LENGTH                              0x1
#define _PWMCON1_COMOD1_MASK                                0x40

// Register: PWMCON0
#define PWMCON0 PWMCON0
extern volatile unsigned char           PWMCON0             __at(0x111);
#ifndef _LIB_BUILD
asm("PWMCON0 equ 0111h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH1EN                  :1;
        unsigned PH2EN                  :1;
        unsigned SYNC                   :2;
        unsigned BLANK1                 :1;
        unsigned BLANK2                 :1;
        unsigned PASEN                  :1;
        unsigned PRSEN                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned SYNC0                  :1;
        unsigned SYNC1                  :1;
    };
} PWMCON0bits_t;
extern volatile PWMCON0bits_t PWMCON0bits __at(0x111);
// bitfield macros
#define _PWMCON0_PH1EN_POSN                                 0x0
#define _PWMCON0_PH1EN_POSITION                             0x0
#define _PWMCON0_PH1EN_SIZE                                 0x1
#define _PWMCON0_PH1EN_LENGTH                               0x1
#define _PWMCON0_PH1EN_MASK                                 0x1
#define _PWMCON0_PH2EN_POSN                                 0x1
#define _PWMCON0_PH2EN_POSITION                             0x1
#define _PWMCON0_PH2EN_SIZE                                 0x1
#define _PWMCON0_PH2EN_LENGTH                               0x1
#define _PWMCON0_PH2EN_MASK                                 0x2
#define _PWMCON0_SYNC_POSN                                  0x2
#define _PWMCON0_SYNC_POSITION                              0x2
#define _PWMCON0_SYNC_SIZE                                  0x2
#define _PWMCON0_SYNC_LENGTH                                0x2
#define _PWMCON0_SYNC_MASK                                  0xC
#define _PWMCON0_BLANK1_POSN                                0x4
#define _PWMCON0_BLANK1_POSITION                            0x4
#define _PWMCON0_BLANK1_SIZE                                0x1
#define _PWMCON0_BLANK1_LENGTH                              0x1
#define _PWMCON0_BLANK1_MASK                                0x10
#define _PWMCON0_BLANK2_POSN                                0x5
#define _PWMCON0_BLANK2_POSITION                            0x5
#define _PWMCON0_BLANK2_SIZE                                0x1
#define _PWMCON0_BLANK2_LENGTH                              0x1
#define _PWMCON0_BLANK2_MASK                                0x20
#define _PWMCON0_PASEN_POSN                                 0x6
#define _PWMCON0_PASEN_POSITION                             0x6
#define _PWMCON0_PASEN_SIZE                                 0x1
#define _PWMCON0_PASEN_LENGTH                               0x1
#define _PWMCON0_PASEN_MASK                                 0x40
#define _PWMCON0_PRSEN_POSN                                 0x7
#define _PWMCON0_PRSEN_POSITION                             0x7
#define _PWMCON0_PRSEN_SIZE                                 0x1
#define _PWMCON0_PRSEN_LENGTH                               0x1
#define _PWMCON0_PRSEN_MASK                                 0x80
#define _PWMCON0_SYNC0_POSN                                 0x2
#define _PWMCON0_SYNC0_POSITION                             0x2
#define _PWMCON0_SYNC0_SIZE                                 0x1
#define _PWMCON0_SYNC0_LENGTH                               0x1
#define _PWMCON0_SYNC0_MASK                                 0x4
#define _PWMCON0_SYNC1_POSN                                 0x3
#define _PWMCON0_SYNC1_POSITION                             0x3
#define _PWMCON0_SYNC1_SIZE                                 0x1
#define _PWMCON0_SYNC1_LENGTH                               0x1
#define _PWMCON0_SYNC1_MASK                                 0x8

