MikroElektronika/core_packages/PIC/XC8/def/PIC16HV785/mcu.h
// Register: PWMCLK
#define PWMCLK PWMCLK
extern volatile unsigned char           PWMCLK              __at(0x112);
#ifndef _LIB_BUILD
asm("PWMCLK equ 0112h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PER                    :5;
        unsigned PWMP                   :2;
        unsigned PWMASE                 :1;
    };
    struct {
        unsigned PER0                   :1;
        unsigned PER1                   :1;
        unsigned PER2                   :1;
        unsigned PER3                   :1;
        unsigned PER4                   :1;
        unsigned PWMP0                  :1;
        unsigned PWMP1                  :1;
    };
} PWMCLKbits_t;
extern volatile PWMCLKbits_t PWMCLKbits __at(0x112);
// bitfield macros
#define _PWMCLK_PER_POSN                                    0x0
#define _PWMCLK_PER_POSITION                                0x0
#define _PWMCLK_PER_SIZE                                    0x5
#define _PWMCLK_PER_LENGTH                                  0x5
#define _PWMCLK_PER_MASK                                    0x1F
#define _PWMCLK_PWMP_POSN                                   0x5
#define _PWMCLK_PWMP_POSITION                               0x5
#define _PWMCLK_PWMP_SIZE                                   0x2
#define _PWMCLK_PWMP_LENGTH                                 0x2
#define _PWMCLK_PWMP_MASK                                   0x60
#define _PWMCLK_PWMASE_POSN                                 0x7
#define _PWMCLK_PWMASE_POSITION                             0x7
#define _PWMCLK_PWMASE_SIZE                                 0x1
#define _PWMCLK_PWMASE_LENGTH                               0x1
#define _PWMCLK_PWMASE_MASK                                 0x80
#define _PWMCLK_PER0_POSN                                   0x0
#define _PWMCLK_PER0_POSITION                               0x0
#define _PWMCLK_PER0_SIZE                                   0x1
#define _PWMCLK_PER0_LENGTH                                 0x1
#define _PWMCLK_PER0_MASK                                   0x1
#define _PWMCLK_PER1_POSN                                   0x1
#define _PWMCLK_PER1_POSITION                               0x1
#define _PWMCLK_PER1_SIZE                                   0x1
#define _PWMCLK_PER1_LENGTH                                 0x1
#define _PWMCLK_PER1_MASK                                   0x2
#define _PWMCLK_PER2_POSN                                   0x2
#define _PWMCLK_PER2_POSITION                               0x2
#define _PWMCLK_PER2_SIZE                                   0x1
#define _PWMCLK_PER2_LENGTH                                 0x1
#define _PWMCLK_PER2_MASK                                   0x4
#define _PWMCLK_PER3_POSN                                   0x3
#define _PWMCLK_PER3_POSITION                               0x3
#define _PWMCLK_PER3_SIZE                                   0x1
#define _PWMCLK_PER3_LENGTH                                 0x1
#define _PWMCLK_PER3_MASK                                   0x8
#define _PWMCLK_PER4_POSN                                   0x4
#define _PWMCLK_PER4_POSITION                               0x4
#define _PWMCLK_PER4_SIZE                                   0x1
#define _PWMCLK_PER4_LENGTH                                 0x1
#define _PWMCLK_PER4_MASK                                   0x10
#define _PWMCLK_PWMP0_POSN                                  0x5
#define _PWMCLK_PWMP0_POSITION                              0x5
#define _PWMCLK_PWMP0_SIZE                                  0x1
#define _PWMCLK_PWMP0_LENGTH                                0x1
#define _PWMCLK_PWMP0_MASK                                  0x20
#define _PWMCLK_PWMP1_POSN                                  0x6
#define _PWMCLK_PWMP1_POSITION                              0x6
#define _PWMCLK_PWMP1_SIZE                                  0x1
#define _PWMCLK_PWMP1_LENGTH                                0x1
#define _PWMCLK_PWMP1_MASK                                  0x40

// Register: PWMPH1
#define PWMPH1 PWMPH1
extern volatile unsigned char           PWMPH1              __at(0x113);
#ifndef _LIB_BUILD
asm("PWMPH1 equ 0113h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :5;
        unsigned C1EN                   :1;
        unsigned C2EN                   :1;
        unsigned POL                    :1;
    };
    struct {
        unsigned PH0                    :1;
        unsigned PH1                    :1;
        unsigned PH2                    :1;
        unsigned PH3                    :1;
        unsigned PH4                    :1;
    };
} PWMPH1bits_t;
extern volatile PWMPH1bits_t PWMPH1bits __at(0x113);
// bitfield macros
#define _PWMPH1_PH_POSN                                     0x0
#define _PWMPH1_PH_POSITION                                 0x0
#define _PWMPH1_PH_SIZE                                     0x5
#define _PWMPH1_PH_LENGTH                                   0x5
#define _PWMPH1_PH_MASK                                     0x1F
#define _PWMPH1_C1EN_POSN                                   0x5
#define _PWMPH1_C1EN_POSITION                               0x5
#define _PWMPH1_C1EN_SIZE                                   0x1
#define _PWMPH1_C1EN_LENGTH                                 0x1
#define _PWMPH1_C1EN_MASK                                   0x20
#define _PWMPH1_C2EN_POSN                                   0x6
#define _PWMPH1_C2EN_POSITION                               0x6
#define _PWMPH1_C2EN_SIZE                                   0x1
#define _PWMPH1_C2EN_LENGTH                                 0x1
#define _PWMPH1_C2EN_MASK                                   0x40
#define _PWMPH1_POL_POSN                                    0x7
#define _PWMPH1_POL_POSITION                                0x7
#define _PWMPH1_POL_SIZE                                    0x1
#define _PWMPH1_POL_LENGTH                                  0x1
#define _PWMPH1_POL_MASK                                    0x80
#define _PWMPH1_PH0_POSN                                    0x0
#define _PWMPH1_PH0_POSITION                                0x0
#define _PWMPH1_PH0_SIZE                                    0x1
#define _PWMPH1_PH0_LENGTH                                  0x1
#define _PWMPH1_PH0_MASK                                    0x1
#define _PWMPH1_PH1_POSN                                    0x1
#define _PWMPH1_PH1_POSITION                                0x1
#define _PWMPH1_PH1_SIZE                                    0x1
#define _PWMPH1_PH1_LENGTH                                  0x1
#define _PWMPH1_PH1_MASK                                    0x2
#define _PWMPH1_PH2_POSN                                    0x2
#define _PWMPH1_PH2_POSITION                                0x2
#define _PWMPH1_PH2_SIZE                                    0x1
#define _PWMPH1_PH2_LENGTH                                  0x1
#define _PWMPH1_PH2_MASK                                    0x4
#define _PWMPH1_PH3_POSN                                    0x3
#define _PWMPH1_PH3_POSITION                                0x3
#define _PWMPH1_PH3_SIZE                                    0x1
#define _PWMPH1_PH3_LENGTH                                  0x1
#define _PWMPH1_PH3_MASK                                    0x8
#define _PWMPH1_PH4_POSN                                    0x4
#define _PWMPH1_PH4_POSITION                                0x4
#define _PWMPH1_PH4_SIZE                                    0x1
#define _PWMPH1_PH4_LENGTH                                  0x1
#define _PWMPH1_PH4_MASK                                    0x10

// Register: PWMPH2
#define PWMPH2 PWMPH2
extern volatile unsigned char           PWMPH2              __at(0x114);
#ifndef _LIB_BUILD
asm("PWMPH2 equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :5;
        unsigned C1EN                   :1;
        unsigned C2EN                   :1;
        unsigned POL                    :1;
    };
    struct {
        unsigned PH0                    :1;
        unsigned PH1                    :1;
        unsigned PH2                    :1;
        unsigned PH3                    :1;
        unsigned PH4                    :1;
    };
} PWMPH2bits_t;
extern volatile PWMPH2bits_t PWMPH2bits __at(0x114);
// bitfield macros
#define _PWMPH2_PH_POSN                                     0x0
#define _PWMPH2_PH_POSITION                                 0x0
#define _PWMPH2_PH_SIZE                                     0x5
#define _PWMPH2_PH_LENGTH                                   0x5
#define _PWMPH2_PH_MASK                                     0x1F
#define _PWMPH2_C1EN_POSN                                   0x5
#define _PWMPH2_C1EN_POSITION                               0x5
#define _PWMPH2_C1EN_SIZE                                   0x1
#define _PWMPH2_C1EN_LENGTH                                 0x1
#define _PWMPH2_C1EN_MASK                                   0x20
#define _PWMPH2_C2EN_POSN                                   0x6
#define _PWMPH2_C2EN_POSITION                               0x6
#define _PWMPH2_C2EN_SIZE                                   0x1
#define _PWMPH2_C2EN_LENGTH                                 0x1
#define _PWMPH2_C2EN_MASK                                   0x40
#define _PWMPH2_POL_POSN                                    0x7
#define _PWMPH2_POL_POSITION                                0x7
#define _PWMPH2_POL_SIZE                                    0x1
#define _PWMPH2_POL_LENGTH                                  0x1
#define _PWMPH2_POL_MASK                                    0x80
#define _PWMPH2_PH0_POSN                                    0x0
#define _PWMPH2_PH0_POSITION                                0x0
#define _PWMPH2_PH0_SIZE                                    0x1
#define _PWMPH2_PH0_LENGTH                                  0x1
#define _PWMPH2_PH0_MASK                                    0x1
#define _PWMPH2_PH1_POSN                                    0x1
#define _PWMPH2_PH1_POSITION                                0x1
#define _PWMPH2_PH1_SIZE                                    0x1
#define _PWMPH2_PH1_LENGTH                                  0x1
#define _PWMPH2_PH1_MASK                                    0x2
#define _PWMPH2_PH2_POSN                                    0x2
#define _PWMPH2_PH2_POSITION                                0x2
#define _PWMPH2_PH2_SIZE                                    0x1
#define _PWMPH2_PH2_LENGTH                                  0x1
#define _PWMPH2_PH2_MASK                                    0x4
#define _PWMPH2_PH3_POSN                                    0x3
#define _PWMPH2_PH3_POSITION                                0x3
#define _PWMPH2_PH3_SIZE                                    0x1
#define _PWMPH2_PH3_LENGTH                                  0x1
#define _PWMPH2_PH3_MASK                                    0x8
#define _PWMPH2_PH4_POSN                                    0x4
#define _PWMPH2_PH4_POSITION                                0x4
#define _PWMPH2_PH4_SIZE                                    0x1
#define _PWMPH2_PH4_LENGTH                                  0x1
#define _PWMPH2_PH4_MASK                                    0x10

// Register: CM1CON0
#define CM1CON0 CM1CON0
extern volatile unsigned char           CM1CON0             __at(0x119);
#ifndef _LIB_BUILD
asm("CM1CON0 equ 0119h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1CH                   :2;
        unsigned C1R                    :1;
        unsigned C1SP                   :1;
        unsigned C1POL                  :1;
        unsigned C1OE                   :1;
        unsigned C1OUT                  :1;
        unsigned C1ON                   :1;
    };
    struct {
        unsigned C1CH0                  :1;
        unsigned C1CH1                  :1;
    };
} CM1CON0bits_t;
extern volatile CM1CON0bits_t CM1CON0bits __at(0x119);
// bitfield macros
#define _CM1CON0_C1CH_POSN                                  0x0
#define _CM1CON0_C1CH_POSITION                              0x0
#define _CM1CON0_C1CH_SIZE                                  0x2
#define _CM1CON0_C1CH_LENGTH                                0x2
#define _CM1CON0_C1CH_MASK                                  0x3
#define _CM1CON0_C1R_POSN                                   0x2
#define _CM1CON0_C1R_POSITION                               0x2
#define _CM1CON0_C1R_SIZE                                   0x1
#define _CM1CON0_C1R_LENGTH                                 0x1
#define _CM1CON0_C1R_MASK                                   0x4
#define _CM1CON0_C1SP_POSN                                  0x3
#define _CM1CON0_C1SP_POSITION                              0x3
#define _CM1CON0_C1SP_SIZE                                  0x1
#define _CM1CON0_C1SP_LENGTH                                0x1
#define _CM1CON0_C1SP_MASK                                  0x8
#define _CM1CON0_C1POL_POSN                                 0x4
#define _CM1CON0_C1POL_POSITION                             0x4
#define _CM1CON0_C1POL_SIZE                                 0x1
#define _CM1CON0_C1POL_LENGTH                               0x1
#define _CM1CON0_C1POL_MASK                                 0x10
#define _CM1CON0_C1OE_POSN                                  0x5
#define _CM1CON0_C1OE_POSITION                              0x5
#define _CM1CON0_C1OE_SIZE                                  0x1
#define _CM1CON0_C1OE_LENGTH                                0x1
#define _CM1CON0_C1OE_MASK                                  0x20
#define _CM1CON0_C1OUT_POSN                                 0x6
#define _CM1CON0_C1OUT_POSITION                             0x6
#define _CM1CON0_C1OUT_SIZE                                 0x1
#define _CM1CON0_C1OUT_LENGTH                               0x1
#define _CM1CON0_C1OUT_MASK                                 0x40
#define _CM1CON0_C1ON_POSN                                  0x7
#define _CM1CON0_C1ON_POSITION                              0x7
#define _CM1CON0_C1ON_SIZE                                  0x1
#define _CM1CON0_C1ON_LENGTH                                0x1
#define _CM1CON0_C1ON_MASK                                  0x80
#define _CM1CON0_C1CH0_POSN                                 0x0
#define _CM1CON0_C1CH0_POSITION                             0x0
#define _CM1CON0_C1CH0_SIZE                                 0x1
#define _CM1CON0_C1CH0_LENGTH                               0x1
#define _CM1CON0_C1CH0_MASK                                 0x1
#define _CM1CON0_C1CH1_POSN                                 0x1
#define _CM1CON0_C1CH1_POSITION                             0x1
#define _CM1CON0_C1CH1_SIZE                                 0x1
#define _CM1CON0_C1CH1_LENGTH                               0x1
#define _CM1CON0_C1CH1_MASK                                 0x2

// Register: CM2CON0
#define CM2CON0 CM2CON0
extern volatile unsigned char           CM2CON0             __at(0x11A);
#ifndef _LIB_BUILD
asm("CM2CON0 equ 011Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2CH                   :2;
        unsigned C2R                    :1;
        unsigned C2SP                   :1;
        unsigned C2POL                  :1;
        unsigned C2OE                   :1;
        unsigned C2OUT                  :1;
        unsigned C2ON                   :1;
    };
    struct {
        unsigned C2CH0                  :1;
        unsigned C2CH1                  :1;
    };
} CM2CON0bits_t;
extern volatile CM2CON0bits_t CM2CON0bits __at(0x11A);
// bitfield macros
#define _CM2CON0_C2CH_POSN                                  0x0
#define _CM2CON0_C2CH_POSITION                              0x0
#define _CM2CON0_C2CH_SIZE                                  0x2
#define _CM2CON0_C2CH_LENGTH                                0x2
#define _CM2CON0_C2CH_MASK                                  0x3
#define _CM2CON0_C2R_POSN                                   0x2
#define _CM2CON0_C2R_POSITION                               0x2
#define _CM2CON0_C2R_SIZE                                   0x1
#define _CM2CON0_C2R_LENGTH                                 0x1
#define _CM2CON0_C2R_MASK                                   0x4
#define _CM2CON0_C2SP_POSN                                  0x3
#define _CM2CON0_C2SP_POSITION                              0x3
#define _CM2CON0_C2SP_SIZE                                  0x1
#define _CM2CON0_C2SP_LENGTH                                0x1
#define _CM2CON0_C2SP_MASK                                  0x8
#define _CM2CON0_C2POL_POSN                                 0x4
#define _CM2CON0_C2POL_POSITION                             0x4
#define _CM2CON0_C2POL_SIZE                                 0x1
#define _CM2CON0_C2POL_LENGTH                               0x1
#define _CM2CON0_C2POL_MASK                                 0x10
#define _CM2CON0_C2OE_POSN                                  0x5
#define _CM2CON0_C2OE_POSITION                              0x5
#define _CM2CON0_C2OE_SIZE                                  0x1
#define _CM2CON0_C2OE_LENGTH                                0x1
#define _CM2CON0_C2OE_MASK                                  0x20
#define _CM2CON0_C2OUT_POSN                                 0x6
#define _CM2CON0_C2OUT_POSITION                             0x6
#define _CM2CON0_C2OUT_SIZE                                 0x1
#define _CM2CON0_C2OUT_LENGTH                               0x1
#define _CM2CON0_C2OUT_MASK                                 0x40
#define _CM2CON0_C2ON_POSN                                  0x7
#define _CM2CON0_C2ON_POSITION                              0x7
#define _CM2CON0_C2ON_SIZE                                  0x1
#define _CM2CON0_C2ON_LENGTH                                0x1
#define _CM2CON0_C2ON_MASK                                  0x80
#define _CM2CON0_C2CH0_POSN                                 0x0
#define _CM2CON0_C2CH0_POSITION                             0x0
#define _CM2CON0_C2CH0_SIZE                                 0x1
#define _CM2CON0_C2CH0_LENGTH                               0x1
#define _CM2CON0_C2CH0_MASK                                 0x1
#define _CM2CON0_C2CH1_POSN                                 0x1
#define _CM2CON0_C2CH1_POSITION                             0x1
#define _CM2CON0_C2CH1_SIZE                                 0x1
#define _CM2CON0_C2CH1_LENGTH                               0x1
#define _CM2CON0_C2CH1_MASK                                 0x2

// Register: CM2CON1
#define CM2CON1 CM2CON1
extern volatile unsigned char           CM2CON1             __at(0x11B);
#ifndef _LIB_BUILD
asm("CM2CON1 equ 011Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2SYNC                 :1;
        unsigned T1GSS                  :1;
        unsigned                        :4;
        unsigned MC2OUT                 :1;
        unsigned MC1OUT                 :1;
    };
} CM2CON1bits_t;
extern volatile CM2CON1bits_t CM2CON1bits __at(0x11B);
// bitfield macros
#define _CM2CON1_C2SYNC_POSN                                0x0
#define _CM2CON1_C2SYNC_POSITION                            0x0
#define _CM2CON1_C2SYNC_SIZE                                0x1
#define _CM2CON1_C2SYNC_LENGTH                              0x1
#define _CM2CON1_C2SYNC_MASK                                0x1
#define _CM2CON1_T1GSS_POSN                                 0x1
#define _CM2CON1_T1GSS_POSITION                             0x1
#define _CM2CON1_T1GSS_SIZE                                 0x1
#define _CM2CON1_T1GSS_LENGTH                               0x1
#define _CM2CON1_T1GSS_MASK                                 0x2
#define _CM2CON1_MC2OUT_POSN                                0x6
#define _CM2CON1_MC2OUT_POSITION                            0x6
#define _CM2CON1_MC2OUT_SIZE                                0x1
#define _CM2CON1_MC2OUT_LENGTH                              0x1
#define _CM2CON1_MC2OUT_MASK                                0x40
#define _CM2CON1_MC1OUT_POSN                                0x7
#define _CM2CON1_MC1OUT_POSITION                            0x7
#define _CM2CON1_MC1OUT_SIZE                                0x1
#define _CM2CON1_MC1OUT_LENGTH                              0x1
#define _CM2CON1_MC1OUT_MASK                                0x80

