MikroElektronika/core_packages/PIC/XC8/def/PIC16HV785/mcu.h
// Register: OPA1CON
#define OPA1CON OPA1CON
extern volatile unsigned char           OPA1CON             __at(0x11C);
#ifndef _LIB_BUILD
asm("OPA1CON equ 011Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :7;
        unsigned OPAON                  :1;
    };
} OPA1CONbits_t;
extern volatile OPA1CONbits_t OPA1CONbits __at(0x11C);
// bitfield macros
#define _OPA1CON_OPAON_POSN                                 0x7
#define _OPA1CON_OPAON_POSITION                             0x7
#define _OPA1CON_OPAON_SIZE                                 0x1
#define _OPA1CON_OPAON_LENGTH                               0x1
#define _OPA1CON_OPAON_MASK                                 0x80

// Register: OPA2CON
#define OPA2CON OPA2CON
extern volatile unsigned char           OPA2CON             __at(0x11D);
#ifndef _LIB_BUILD
asm("OPA2CON equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :7;
        unsigned OPAON                  :1;
    };
} OPA2CONbits_t;
extern volatile OPA2CONbits_t OPA2CONbits __at(0x11D);
// bitfield macros
#define _OPA2CON_OPAON_POSN                                 0x7
#define _OPA2CON_OPAON_POSITION                             0x7
#define _OPA2CON_OPAON_SIZE                                 0x1
#define _OPA2CON_OPAON_LENGTH                               0x1
#define _OPA2CON_OPAON_MASK                                 0x80

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// ADCON1<ADCS0>
extern volatile __bit                   ADCS0               __at(0x4FC);	// @ (0x9F * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<ADCS1>
extern volatile __bit                   ADCS1               __at(0x4FD);	// @ (0x9F * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<ADCS2>
extern volatile __bit                   ADCS2               __at(0x4FE);	// @ (0x9F * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON1,6)
// ADCON0<ADFM>
extern volatile __bit                   ADFM                __at(0xFF);	// @ (0x1F * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON0,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x466);	// @ (0x8C * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x66);	// @ (0xC * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ANSEL0<ANS0>
extern volatile __bit                   ANS0                __at(0x488);	// @ (0x91 * 8 + 0)
#define                                 ANS0_bit            _BIT_ACCESS(ANSEL0,0)
// ANSEL0<ANS1>
extern volatile __bit                   ANS1                __at(0x489);	// @ (0x91 * 8 + 1)
#define                                 ANS1_bit            _BIT_ACCESS(ANSEL0,1)
// ANSEL1<ANS10>
extern volatile __bit                   ANS10               __at(0x49A);	// @ (0x93 * 8 + 2)
#define                                 ANS10_bit           _BIT_ACCESS(ANSEL1,2)
// ANSEL1<ANS11>
extern volatile __bit                   ANS11               __at(0x49B);	// @ (0x93 * 8 + 3)
#define                                 ANS11_bit           _BIT_ACCESS(ANSEL1,3)
// ANSEL0<ANS2>
extern volatile __bit                   ANS2                __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 ANS2_bit            _BIT_ACCESS(ANSEL0,2)
// ANSEL0<ANS3>
extern volatile __bit                   ANS3                __at(0x48B);	// @ (0x91 * 8 + 3)
#define                                 ANS3_bit            _BIT_ACCESS(ANSEL0,3)
// ANSEL0<ANS4>
extern volatile __bit                   ANS4                __at(0x48C);	// @ (0x91 * 8 + 4)
#define                                 ANS4_bit            _BIT_ACCESS(ANSEL0,4)
// ANSEL0<ANS5>
extern volatile __bit                   ANS5                __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 ANS5_bit            _BIT_ACCESS(ANSEL0,5)
// ANSEL0<ANS6>
extern volatile __bit                   ANS6                __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 ANS6_bit            _BIT_ACCESS(ANSEL0,6)
// ANSEL0<ANS7>
extern volatile __bit                   ANS7                __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 ANS7_bit            _BIT_ACCESS(ANSEL0,7)
// ANSEL1<ANS8>
extern volatile __bit                   ANS8                __at(0x498);	// @ (0x93 * 8 + 0)
#define                                 ANS8_bit            _BIT_ACCESS(ANSEL1,0)
// ANSEL1<ANS9>
extern volatile __bit                   ANS9                __at(0x499);	// @ (0x93 * 8 + 1)
#define                                 ANS9_bit            _BIT_ACCESS(ANSEL1,1)
// REFCON<BGST>
extern volatile __bit                   BGST                __at(0x4C5);	// @ (0x98 * 8 + 5)
#define                                 BGST_bit            _BIT_ACCESS(REFCON,5)
// PWMCON0<BLANK1>
extern volatile __bit                   BLANK1              __at(0x88C);	// @ (0x111 * 8 + 4)
#define                                 BLANK1_bit          _BIT_ACCESS(PWMCON0,4)
// PWMCON0<BLANK2>
extern volatile __bit                   BLANK2              __at(0x88D);	// @ (0x111 * 8 + 5)
#define                                 BLANK2_bit          _BIT_ACCESS(PWMCON0,5)
// CM1CON0<C1CH0>
extern volatile __bit                   C1CH0               __at(0x8C8);	// @ (0x119 * 8 + 0)
#define                                 C1CH0_bit           _BIT_ACCESS(CM1CON0,0)
// CM1CON0<C1CH1>
extern volatile __bit                   C1CH1               __at(0x8C9);	// @ (0x119 * 8 + 1)
#define                                 C1CH1_bit           _BIT_ACCESS(CM1CON0,1)
// PIE1<C1IE>
extern volatile __bit                   C1IE                __at(0x463);	// @ (0x8C * 8 + 3)
#define                                 C1IE_bit            _BIT_ACCESS(PIE1,3)
// PIR1<C1IF>
extern volatile __bit                   C1IF                __at(0x63);	// @ (0xC * 8 + 3)
#define                                 C1IF_bit            _BIT_ACCESS(PIR1,3)
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x8CD);	// @ (0x119 * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x8CF);	// @ (0x119 * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x8CE);	// @ (0x119 * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x8CC);	// @ (0x119 * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1R>
extern volatile __bit                   C1R                 __at(0x8CA);	// @ (0x119 * 8 + 2)
#define                                 C1R_bit             _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x8CB);	// @ (0x119 * 8 + 3)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,3)
// VRCON<C1VREN>
extern volatile __bit                   C1VREN              __at(0x4CF);	// @ (0x99 * 8 + 7)
#define                                 C1VREN_bit          _BIT_ACCESS(VRCON,7)
// CM2CON0<C2CH0>
extern volatile __bit                   C2CH0               __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 C2CH0_bit           _BIT_ACCESS(CM2CON0,0)
// CM2CON0<C2CH1>
extern volatile __bit                   C2CH1               __at(0x8D1);	// @ (0x11A * 8 + 1)
#define                                 C2CH1_bit           _BIT_ACCESS(CM2CON0,1)
// PIE1<C2IE>
extern volatile __bit                   C2IE                __at(0x464);	// @ (0x8C * 8 + 4)
#define                                 C2IE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<C2IF>
extern volatile __bit                   C2IF                __at(0x64);	// @ (0xC * 8 + 4)
#define                                 C2IF_bit            _BIT_ACCESS(PIR1,4)
// CM2CON0<C2OE>
extern volatile __bit                   C2OE                __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 C2OE_bit            _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x8D7);	// @ (0x11A * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x8D6);	// @ (0x11A * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2R>
extern volatile __bit                   C2R                 __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 C2R_bit             _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,3)
// CM2CON1<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON1,0)
// VRCON<C2VREN>
extern volatile __bit                   C2VREN              __at(0x4CE);	// @ (0x99 * 8 + 6)
#define                                 C2VREN_bit          _BIT_ACCESS(VRCON,6)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PIE1<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x465);	// @ (0x8C * 8 + 5)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE1,5)
// PIR1<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x65);	// @ (0xC * 8 + 5)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR1,5)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0xA8);	// @ (0x15 * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0xA9);	// @ (0x15 * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0xAA);	// @ (0x15 * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0xAB);	// @ (0x15 * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0xFD);	// @ (0x1F * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// PWMCON1<CMDLY0>
extern volatile __bit                   CMDLY0              __at(0x880);	// @ (0x110 * 8 + 0)
#define                                 CMDLY0_bit          _BIT_ACCESS(PWMCON1,0)
// PWMCON1<CMDLY1>
extern volatile __bit                   CMDLY1              __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 CMDLY1_bit          _BIT_ACCESS(PWMCON1,1)
// PWMCON1<CMDLY2>
extern volatile __bit                   CMDLY2              __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 CMDLY2_bit          _BIT_ACCESS(PWMCON1,2)
// PWMCON1<CMDLY3>
extern volatile __bit                   CMDLY3              __at(0x883);	// @ (0x110 * 8 + 3)
#define                                 CMDLY3_bit          _BIT_ACCESS(PWMCON1,3)
// PWMCON1<CMDLY4>
extern volatile __bit                   CMDLY4              __at(0x884);	// @ (0x110 * 8 + 4)
#define                                 CMDLY4_bit          _BIT_ACCESS(PWMCON1,4)
// PWMCON1<COMOD0>
extern volatile __bit                   COMOD0              __at(0x885);	// @ (0x110 * 8 + 5)
#define                                 COMOD0_bit          _BIT_ACCESS(PWMCON1,5)
// PWMCON1<COMOD1>
extern volatile __bit                   COMOD1              __at(0x886);	// @ (0x110 * 8 + 6)
#define                                 COMOD1_bit          _BIT_ACCESS(PWMCON1,6)
// REFCON<CVROE>
extern volatile __bit                   CVROE               __at(0x4C1);	// @ (0x98 * 8 + 1)
#define                                 CVROE_bit           _BIT_ACCESS(REFCON,1)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0xAC);	// @ (0x15 * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0xAD);	// @ (0x15 * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// PIE1<EEIE>
extern volatile __bit                   EEIE                __at(0x467);	// @ (0x8C * 8 + 7)
#define                                 EEIE_bit            _BIT_ACCESS(PIE1,7)
// PIR1<EEIF>
extern volatile __bit                   EEIF                __at(0x67);	// @ (0xC * 8 + 7)
#define                                 EEIF_bit            _BIT_ACCESS(PIR1,7)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO>
extern volatile __bit                   GO                  __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 GO_bit              _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_DONE>
extern volatile __bit                   GO_DONE             __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 GO_DONE_bit         _BIT_ACCESS(ADCON0,1)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// OSCCON<HTS>
extern volatile __bit                   HTS                 __at(0x47A);	// @ (0x8F * 8 + 2)
#define                                 HTS_bit             _BIT_ACCESS(OSCCON,2)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x40E);	// @ (0x81 * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCA<IOC0>
extern volatile __bit                   IOC0                __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 IOC0_bit            _BIT_ACCESS(IOCA,0)
// IOCA<IOC1>
extern volatile __bit                   IOC1                __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 IOC1_bit            _BIT_ACCESS(IOCA,1)
// IOCA<IOC2>
extern volatile __bit                   IOC2                __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 IOC2_bit            _BIT_ACCESS(IOCA,2)
// IOCA<IOC3>
extern volatile __bit                   IOC3                __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 IOC3_bit            _BIT_ACCESS(IOCA,3)
// IOCA<IOC4>
extern volatile __bit                   IOC4                __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 IOC4_bit            _BIT_ACCESS(IOCA,4)
// IOCA<IOC5>
extern volatile __bit                   IOC5                __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 IOC5_bit            _BIT_ACCESS(IOCA,5)
// IOCA<IOCA0>
extern volatile __bit                   IOCA0               __at(0x4B0);	// @ (0x96 * 8 + 0)
#define                                 IOCA0_bit           _BIT_ACCESS(IOCA,0)
// IOCA<IOCA1>
extern volatile __bit                   IOCA1               __at(0x4B1);	// @ (0x96 * 8 + 1)
#define                                 IOCA1_bit           _BIT_ACCESS(IOCA,1)
// IOCA<IOCA2>
extern volatile __bit                   IOCA2               __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 IOCA2_bit           _BIT_ACCESS(IOCA,2)
// IOCA<IOCA3>
extern volatile __bit                   IOCA3               __at(0x4B3);	// @ (0x96 * 8 + 3)
#define                                 IOCA3_bit           _BIT_ACCESS(IOCA,3)
// IOCA<IOCA4>
extern volatile __bit                   IOCA4               __at(0x4B4);	// @ (0x96 * 8 + 4)
#define                                 IOCA4_bit           _BIT_ACCESS(IOCA,4)
// IOCA<IOCA5>
extern volatile __bit                   IOCA5               __at(0x4B5);	// @ (0x96 * 8 + 5)
#define                                 IOCA5_bit           _BIT_ACCESS(IOCA,5)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x47C);	// @ (0x8F * 8 + 4)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x47D);	// @ (0x8F * 8 + 5)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x47E);	// @ (0x8F * 8 + 6)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,6)
// STATUS<IRP>
extern volatile __bit                   IRP                 __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 IRP_bit             _BIT_ACCESS(STATUS,7)
// OSCCON<LTS>
extern volatile __bit                   LTS                 __at(0x479);	// @ (0x8F * 8 + 1)
#define                                 LTS_bit             _BIT_ACCESS(OSCCON,1)
// CM2CON1<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x8DF);	// @ (0x11B * 8 + 7)
#define                                 MC1OUT_bit          _BIT_ACCESS(CM2CON1,7)
// CM2CON1<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x8DE);	// @ (0x11B * 8 + 6)
#define                                 MC2OUT_bit          _BIT_ACCESS(CM2CON1,6)
// PIE1<OSFIE>
extern volatile __bit                   OSFIE               __at(0x462);	// @ (0x8C * 8 + 2)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE1,2)
// PIR1<OSFIF>
extern volatile __bit                   OSFIF               __at(0x62);	// @ (0xC * 8 + 2)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR1,2)
// OSCCON<OSTS>
extern volatile __bit                   OSTS                __at(0x47B);	// @ (0x8F * 8 + 3)
#define                                 OSTS_bit            _BIT_ACCESS(OSCCON,3)
// PWMCON1<OVRLP>
extern volatile __bit                   OVRLP               __at(0x887);	// @ (0x110 * 8 + 7)
#define                                 OVRLP_bit           _BIT_ACCESS(PWMCON1,7)
// PWMCON0<PASEN>
extern volatile __bit                   PASEN               __at(0x88E);	// @ (0x111 * 8 + 6)
#define                                 PASEN_bit           _BIT_ACCESS(PWMCON0,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// PWMCLK<PER0>
extern volatile __bit                   PER0                __at(0x890);	// @ (0x112 * 8 + 0)
#define                                 PER0_bit            _BIT_ACCESS(PWMCLK,0)
// PWMCLK<PER1>
extern volatile __bit                   PER1                __at(0x891);	// @ (0x112 * 8 + 1)
#define                                 PER1_bit            _BIT_ACCESS(PWMCLK,1)
// PWMCLK<PER2>
extern volatile __bit                   PER2                __at(0x892);	// @ (0x112 * 8 + 2)
#define                                 PER2_bit            _BIT_ACCESS(PWMCLK,2)
// PWMCLK<PER3>
extern volatile __bit                   PER3                __at(0x893);	// @ (0x112 * 8 + 3)
#define                                 PER3_bit            _BIT_ACCESS(PWMCLK,3)
// PWMCLK<PER4>
extern volatile __bit                   PER4                __at(0x894);	// @ (0x112 * 8 + 4)
#define                                 PER4_bit            _BIT_ACCESS(PWMCLK,4)
// PWMCON0<PH1EN>
extern volatile __bit                   PH1EN               __at(0x888);	// @ (0x111 * 8 + 0)
#define                                 PH1EN_bit           _BIT_ACCESS(PWMCON0,0)
// PWMCON0<PH2EN>
extern volatile __bit                   PH2EN               __at(0x889);	// @ (0x111 * 8 + 1)
#define                                 PH2EN_bit           _BIT_ACCESS(PWMCON0,1)
// PWMCON0<PRSEN>
extern volatile __bit                   PRSEN               __at(0x88F);	// @ (0x111 * 8 + 7)
#define                                 PRSEN_bit           _BIT_ACCESS(PWMCON0,7)
// OPTION_REG<PS0>
extern volatile __bit                   PS0                 __at(0x408);	// @ (0x81 * 8 + 0)
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   PS1                 __at(0x409);	// @ (0x81 * 8 + 1)
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   PS2                 __at(0x40A);	// @ (0x81 * 8 + 2)
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x40B);	// @ (0x81 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PWMCLK<PWMASE>
extern volatile __bit                   PWMASE              __at(0x897);	// @ (0x112 * 8 + 7)
#define                                 PWMASE_bit          _BIT_ACCESS(PWMCLK,7)
// PWMCLK<PWMP0>
extern volatile __bit                   PWMP0               __at(0x895);	// @ (0x112 * 8 + 5)
#define                                 PWMP0_bit           _BIT_ACCESS(PWMCLK,5)
// PWMCLK<PWMP1>
